; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 515198 1 2 3 5 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Planet5 thermograph1)
	(have_image Planet6 image0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 planet8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet8)
   goals met: 0 of 4
5. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 1 of 4
6. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 1 of 4
7. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 2 of 4
8. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 2 of 4
9. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 3 of 4
10. (turn_to satellite0 planet5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet5)
   goals met: 3 of 4
11. (take_image satellite0 planet5 instrument0 thermograph1)
   added: (have_image planet5 thermograph1)
   goals met: 4 of 4
